#pandas is used for reading and manipulating the dataset and storing the datas in rows and columns

In [48]:
import pandas as pd
import numpy as np

In [49]:
#creatin a dataset for dictionary of list
data={"name":["nithish","gokul","vijay","mohan"],
      "age":[22,23,24,25],
      "distrcit":["ariyalur","ariyalur","ariyalur","ariyalur"]}

In [50]:
pf=pd.DataFrame(data)
pf

      name  age  distrcit
0  nithish   22  ariyalur
1    gokul   23  ariyalur
2    vijay   24  ariyalur
3    mohan   25  ariyalur

In [51]:
#create a dataset for list of dictionary
data1=[{"name":"nithish","age":22,"district":"ariyalur"},
       {"name":"gokul","age":23,"district":"ariyalur"},
       {"name":"vijay","age":24,"district":"ariyalur"},
       {"name":"mohan","age":25,"district":"ariyalur"}]

In [52]:
df=pd.DataFrame(data1)
df

      name  age  district
0  nithish   22  ariyalur
1    gokul   23  ariyalur
2    vijay   24  ariyalur
3    mohan   25  ariyalur

In [53]:
#pandas series is one dimensional array-like object can hold any datatype.it is similar to columnn
data=[1,2,3,4,5]
pg=pd.Series(data)
print(pg)
print(type(pg))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [54]:
data1={"a":1,"b":2,"c":3,"d":4,"e":5}
ph=pd.Series(data1)
print(ph)
print(type(ph))

a    1
b    2
c    3
d    4
e    5
dtype: int64
<class 'pandas.core.series.Series'>

In [55]:
df

      name  age  district
0  nithish   22  ariyalur
1    gokul   23  ariyalur
2    vijay   24  ariyalur
3    mohan   25  ariyalur

In [56]:
#accessing the specified element
#syntax at[position,column_nmae]
df.at[3,'age']

np.int64(25)

In [57]:
#.iat[row_number,column_index]
df.iat[1,2]

'ariyalur'

In [58]:
df["age"]

0    22
1    23
2    24
3    25
Name: age, dtype: int64

In [59]:
df["age"]=df["age"]+1

In [60]:
df["age"]

0    23
1    24
2    25
3    26
Name: age, dtype: int64

In [61]:
#reading dataset
employee=pd.read_excel("E:\\download\\Employee.xlsx")

In [62]:
employee.head()

   emp_id   emp_job      emp_branch
0       1        hr  123 abc colony
1       2  employee     234 adaiyar
2       3  employee     5g rain bow
3       4        hr  123 abc colony
4       5  employee     5g rain bow

In [63]:
#checking null values
employee.isnull().any()

emp_id        False
emp_job       False
emp_branch    False
dtype: bool

In [64]:
employee.isnull().sum()

emp_id        0
emp_job       0
emp_branch    0
dtype: int64

In [65]:
employee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 19 entries, 0 to 18
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   emp_id      19 non-null     int64
 1   emp_job     19 non-null     object
 2   emp_branch  19 non-null     object
dtypes: int64(1), object(2)
memory usage: 588.0+ bytes

In [66]:
employee.dtypes

emp_id         int64
emp_job       object
emp_branch    object
dtype: object

In [67]:
#drop column in dataset
employee.drop('emp_branch',axis=1)

    emp_id   emp_job
0        1        hr
1        2  employee
2        3  employee
3        4        hr
4        5  employee
5        6   manager
6        7  employee
7        8   manager
8        9        hr
9       10   manager
10      11   manager
11      12  employee
12      13  employee
13      14   manager
14      15  employee
15      16   manager
16      17  employee
17      18  employee
18      19   manager

In [ ]:
#renaming the column

employee.rename(columns={"emp_job":"employee_job"},inplace=True)

In [76]:
#retrieving the data using loc and iloc using slicing
employee.loc[:,"emp_branch"]

0     123 abc colony
1        234 adaiyar
2        5g rain bow
3     123 abc colony
4        5g rain bow
5        234 adaiyar
6        5g rain bow
7         321 mathur
8     123 abc colony
9        5g rain bow
10       234 adaiyar
11        321 mathur
12    123 abc colony
13       5g rain bow
14       234 adaiyar
15        321 mathur
16    123 abc colony
17       5g rain bow
18       234 adaiyar
Name: emp_branch, dtype: object

In [87]:
result=employee.groupby('employee_job')['emp_branch'].count()

In [88]:
result

employee_job
employee    9
hr          3
manager     7
Name: emp_branch, dtype: int64

In [79]:
employee.iloc[:,0:2]

    emp_id employee_job
0        1           hr
1        2     employee
2        3     employee
3        4           hr
4        5     employee
5        6      manager
6        7     employee
7        8      manager
8        9           hr
9       10      manager
10      11      manager
11      12     employee
12      13     employee
13      14      manager
14      15     employee
15      16      manager
16      17     employee
17      18     employee
18      19      manager

In [80]:
df1=pd.DataFrame({"keys":["a","b","c"],"values":[1,2,3]})
df2=pd.DataFrame({"keys":["a","b","d"],"values":[4,5,6]})

In [81]:
#merge in pandas
inner=pd.merge(df1,df2,on='keys',how='inner')
inner

  keys  values_x  values_y
0    a         1         4
1    b         2         5

In [82]:
outer=pd.merge(df1,df2,on='keys',how='outer')
outer

  keys  values_x  values_y
0    a       1.0       4.0
1    b       2.0       5.0
2    c       3.0       NaN
3    d       NaN       6.0

In [83]:
left=pd.merge(df1,df2,on='keys',how='left')
left

  keys  values_x  values_y
0    a         1       4.0
1    b         2       5.0
2    c         3       NaN

In [84]:
right=pd.merge(df1,df2,on='keys',how='right')
right

  keys  values_x  values_y
0    a       1.0         4
1    b       2.0         5
2    d       NaN         6